In [123]:
#pip install pandas

In [124]:
import pandas as pd

In [125]:
pd.__version__

'1.4.4'

In [126]:
import numpy as np

In [127]:
a = np.array([10,20,30,40])
a

array([10, 20, 30, 40])

In [128]:
type(a)

numpy.ndarray

In [129]:
b = pd.Series(a)
print(b)

0    10
1    20
2    30
3    40
dtype: int32

In [130]:
type(b)

pandas.core.series.Series

In [131]:
b = pd.Series([10,20,30,40])
b

0    10
1    20
2    30
3    40
dtype: int64

In [132]:
l = [10,20,30,40,50]
l1 = ['a','b','c','d','e']
b = pd.Series(l, index = l1)
print(b)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [133]:
b.values

array([10, 20, 30, 40, 50], dtype=int64)

In [134]:
b['a'], b['e']

(10, 50)

In [135]:
b[0], b[1]

(10, 20)

In [136]:
'a', a

('a', array([10, 20, 30, 40]))

In [137]:
a = 5

In [138]:
a

5

In [139]:
'a'

'a'

In [140]:
b.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [141]:
b.values

array([10, 20, 30, 40, 50], dtype=int64)

In [142]:
b

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [143]:
b[0], b[1],b[2],b[3]

(10, 20, 30, 40)

In [144]:
d = {'a':10, 'b':20}
d

{'a': 10, 'b': 20}

In [145]:
d.keys()

dict_keys(['a', 'b'])

In [146]:
type(b)

pandas.core.series.Series

In [147]:
b

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [148]:
b.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [149]:
b.values

array([10, 20, 30, 40, 50], dtype=int64)

In [150]:
b

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [151]:
b['a'], b['e'] #accessing using label

(10, 50)

In [152]:
b[0]

10

In [153]:
a

5

In [154]:
'a', a

('a', 5)

# Creating a series with a dictionary

In [155]:
d = {'a':10, 'b':20}
d

{'a': 10, 'b': 20}

In [156]:
d.keys()

dict_keys(['a', 'b'])

In [157]:
d.values()

dict_values([10, 20])

In [158]:
e = pd.Series(d)
e

a    10
b    20
dtype: int64

# Creating  a stories of typedatetime

In [159]:
dates_series = pd.date_range(start='11-09-2017',end='12-12-2017')
dates_series

DatetimeIndex(['2017-11-09', '2017-11-10', '2017-11-11', '2017-11-12',
               '2017-11-13', '2017-11-14', '2017-11-15', '2017-11-16',
               '2017-11-17', '2017-11-18', '2017-11-19', '2017-11-20',
               '2017-11-21', '2017-11-22', '2017-11-23', '2017-11-24',
               '2017-11-25', '2017-11-26', '2017-11-27', '2017-11-28',
               '2017-11-29', '2017-11-30', '2017-12-01', '2017-12-02',
               '2017-12-03', '2017-12-04', '2017-12-05', '2017-12-06',
               '2017-12-07', '2017-12-08', '2017-12-09', '2017-12-10',
               '2017-12-11', '2017-12-12'],
              dtype='datetime64[ns]', freq='D')

# Indexing series

In [160]:
l = [10,20,30,40,50,60]

In [161]:
l[0]

10

In [162]:
s = pd.Series(l)
s

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [163]:
s[0]

10

In [164]:
s[2]

30

In [165]:
s[2:]

2    30
3    40
4    50
5    60
dtype: int64

In [166]:
s = pd.Series(dtype='object')
s

Series([], dtype: object)

# Creating dataframe from  dictionary

In [167]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

Differnt DataFrame using Dictonary

In [168]:
data = {
    'Name' : ['ajay','atul', 'arun', 'raj'],
    'Age' :  [24,25,26,64]
}
data

{'Name': ['ajay', 'atul', 'arun', 'raj'], 'Age': [24, 25, 26, 64]}

In [169]:
df = pd.DataFrame(data)
df

   Name  Age
0  ajay   24
1  atul   25
2  arun   26
3   raj   64

In [170]:
data = {
    'col1' : ['items1', 'item2', 'item3', 'item4'],
    'col2' : ['items1', 'item2', 'item3', 'item4'],
    'col3' : ['items1', 'item2', 'item3', 'item4'],
    'col4' : ['items1', 'item2', 'item3', 'item4']
    
}
data

{'col1': ['items1', 'item2', 'item3', 'item4'],
 'col2': ['items1', 'item2', 'item3', 'item4'],
 'col3': ['items1', 'item2', 'item3', 'item4'],
 'col4': ['items1', 'item2', 'item3', 'item4']}

In [171]:
df = pd.DataFrame(data)
df

     col1    col2    col3    col4
0  items1  items1  items1  items1
1   item2   item2   item2   item2
2   item3   item3   item3   item3
3   item4   item4   item4   item4

In [172]:
sample_df = pd.DataFrame(data)
df

     col1    col2    col3    col4
0  items1  items1  items1  items1
1   item2   item2   item2   item2
2   item3   item3   item3   item3
3   item4   item4   item4   item4

Info

In [173]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      object
 1   col2    4 non-null      object
 2   col3    4 non-null      object
 3   col4    4 non-null      object
dtypes: object(4)
memory usage: 256.0+ bytes

In [174]:
sample_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      object
 1   col2    4 non-null      object
 2   col3    4 non-null      object
 3   col4    4 non-null      object
dtypes: object(4)
memory usage: 256.0+ bytes

In [175]:
type(sample_df)

pandas.core.frame.DataFrame

# Creating DataFrame using Tuple

In [176]:
data = [
    ('1/1/2019',23,6,'Rain'),
    ('2/1/2019',11,7,'Fog'),
    ('3/1/2019',26,8,'sunny'),
    ('4/1/2019',13,9,'snow')
]
data

[('1/1/2019', 23, 6, 'Rain'),
 ('2/1/2019', 11, 7, 'Fog'),
 ('3/1/2019', 26, 8, 'sunny'),
 ('4/1/2019', 13, 9, 'snow')]

In [177]:
df = pd.DataFrame(data)
df

          0   1  2      3
0  1/1/2019  23  6   Rain
1  2/1/2019  11  7    Fog
2  3/1/2019  26  8  sunny
3  4/1/2019  13  9   snow

In [178]:
df = pd.DataFrame(data, columns=['Day', 'Temperature', 'Windspeed','Event'])
df

        Day  Temperature  Windspeed  Event
0  1/1/2019           23          6   Rain
1  2/1/2019           11          7    Fog
2  3/1/2019           26          8  sunny
3  4/1/2019           13          9   snow

In [179]:
df.T

                    0         1         2         3
Day          1/1/2019  2/1/2019  3/1/2019  4/1/2019
Temperature        23        11        26        13
Windspeed           6         7         8         9
Event            Rain       Fog     sunny      snow

In [180]:
df

        Day  Temperature  Windspeed  Event
0  1/1/2019           23          6   Rain
1  2/1/2019           11          7    Fog
2  3/1/2019           26          8  sunny
3  4/1/2019           13          9   snow

In [181]:
df.T

                    0         1         2         3
Day          1/1/2019  2/1/2019  3/1/2019  4/1/2019
Temperature        23        11        26        13
Windspeed           6         7         8         9
Event            Rain       Fog     sunny      snow

In [182]:
df.dtypes

Day            object
Temperature     int64
Windspeed       int64
Event          object
dtype: object

In [183]:
df.columns

Index(['Day', 'Temperature', 'Windspeed', 'Event'], dtype='object')

In [184]:
df = pd.DataFrame(data, columns=['Day', 'Temperature', 'Windspeed','Event'], index=['a','b','c','d'])
df

        Day  Temperature  Windspeed  Event
a  1/1/2019           23          6   Rain
b  2/1/2019           11          7    Fog
c  3/1/2019           26          8  sunny
d  4/1/2019           13          9   snow

In [185]:
df.shape

(4, 4)

In [186]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Day          4 non-null      object
 1   Temperature  4 non-null      int64
 2   Windspeed    4 non-null      int64
 3   Event        4 non-null      object
dtypes: int64(2), object(2)
memory usage: 160.0+ bytes

# head-by default head return first 5row

In [187]:
df.head()

        Day  Temperature  Windspeed  Event
a  1/1/2019           23          6   Rain
b  2/1/2019           11          7    Fog
c  3/1/2019           26          8  sunny
d  4/1/2019           13          9   snow

In [188]:
df.head(3)

        Day  Temperature  Windspeed  Event
a  1/1/2019           23          6   Rain
b  2/1/2019           11          7    Fog
c  3/1/2019           26          8  sunny

In [189]:
df.tail(3)

        Day  Temperature  Windspeed  Event
b  2/1/2019           11          7    Fog
c  3/1/2019           26          8  sunny
d  4/1/2019           13          9   snow

Statistics

In [190]:
df

        Day  Temperature  Windspeed  Event
a  1/1/2019           23          6   Rain
b  2/1/2019           11          7    Fog
c  3/1/2019           26          8  sunny
d  4/1/2019           13          9   snow

In [191]:
df['Day']

a    1/1/2019
b    2/1/2019
c    3/1/2019
d    4/1/2019
Name: Day, dtype: object

In [192]:
df['Event']

a     Rain
b      Fog
c    sunny
d     snow
Name: Event, dtype: object

In [193]:
df[['Day', 'Event']]

        Day  Event
a  1/1/2019   Rain
b  2/1/2019    Fog
c  3/1/2019  sunny
d  4/1/2019   snow

In [194]:
df['Temperature']

a    23
b    11
c    26
d    13
Name: Temperature, dtype: int64

In [195]:
type(df['Temperature'])

pandas.core.series.Series

In [196]:
df

        Day  Temperature  Windspeed  Event
a  1/1/2019           23          6   Rain
b  2/1/2019           11          7    Fog
c  3/1/2019           26          8  sunny
d  4/1/2019           13          9   snow

In [197]:
df.sum()

Day            1/1/20192/1/20193/1/20194/1/2019
Temperature                                  73
Windspeed                                    30
Event                          RainFogsunnysnow
dtype: object

# axis 1-row wise sum

In [198]:
df.sum(axis = 0)

Day            1/1/20192/1/20193/1/20194/1/2019
Temperature                                  73
Windspeed                                    30
Event                          RainFogsunnysnow
dtype: object

In [199]:
df.sum()

Day            1/1/20192/1/20193/1/20194/1/2019
Temperature                                  73
Windspeed                                    30
Event                          RainFogsunnysnow
dtype: object

In [200]:
df.sum(axis = 1,numeric_only=True)

a    29
b    18
c    34
d    22
dtype: int64

In [201]:
df

        Day  Temperature  Windspeed  Event
a  1/1/2019           23          6   Rain
b  2/1/2019           11          7    Fog
c  3/1/2019           26          8  sunny
d  4/1/2019           13          9   snow

In [202]:
df['Temperature'].sum()

73

# Mean

In [203]:
df.mean(numeric_only=True)

Temperature    18.25
Windspeed       7.50
dtype: float64

In [204]:
df['Temperature'].mean()

18.25

In [205]:
df['Windspeed'].mean()

7.5

# median

In [206]:
df.median(numeric_only=True)

Temperature    18.0
Windspeed       7.5
dtype: float64

In [207]:
df['Temperature'].median()

18.0

# std()

In [208]:
df.std(numeric_only=True)

Temperature    7.365460
Windspeed      1.290994
dtype: float64

In [209]:
df.std(numeric_only=True)

Temperature    7.365460
Windspeed      1.290994
dtype: float64

# describe()-summary of the data

In [210]:
df.describe()

       Temperature  Windspeed
count      4.00000   4.000000
mean      18.25000   7.500000
std        7.36546   1.290994
min       11.00000   6.000000
25%       12.50000   6.750000
50%       18.00000   7.500000
75%       23.75000   8.250000
max       26.00000   9.000000

# max-return the maximum values

In [211]:
df

        Day  Temperature  Windspeed  Event
a  1/1/2019           23          6   Rain
b  2/1/2019           11          7    Fog
c  3/1/2019           26          8  sunny
d  4/1/2019           13          9   snow

In [212]:
df.max()

Day            4/1/2019
Temperature          26
Windspeed             9
Event             sunny
dtype: object

In [213]:
df['Temperature'].max()

26

min-return the minimum values

In [214]:
df.min()

Day            1/1/2019
Temperature          11
Windspeed             6
Event               Fog
dtype: object

In [215]:
df['Temperature'].min()

11

# Working with .csv

In [216]:
df = pd.read_csv('D:\Sandhya\Data-Science\csv\iris.csv')
df

     SepalLength  SepalWidth  PetalLength  PetalWidth            Name
0            5.1         3.5          1.4         0.2     Iris-setosa
1            4.9         3.0          1.4         0.2     Iris-setosa
2            4.7         3.2          1.3         0.2     Iris-setosa
3            4.6         3.1          1.5         0.2     Iris-setosa
4            5.0         3.6          1.4         0.2     Iris-setosa
..           ...         ...          ...         ...             ...
145          6.7         3.0          5.2         2.3  Iris-virginica
146          6.3         2.5          5.0         1.9  Iris-virginica
147          6.5         3.0          5.2         2.0  Iris-virginica
148          6.2         3.4          5.4         2.3  Iris-virginica
149          5.9         3.0          5.1         1.8  Iris-virginica

[150 rows x 5 columns]

In [217]:
df.head()

   SepalLength  SepalWidth  PetalLength  PetalWidth         Name
0          5.1         3.5          1.4         0.2  Iris-setosa
1          4.9         3.0          1.4         0.2  Iris-setosa
2          4.7         3.2          1.3         0.2  Iris-setosa
3          4.6         3.1          1.5         0.2  Iris-setosa
4          5.0         3.6          1.4         0.2  Iris-setosa

In [218]:
df.tail()

     SepalLength  SepalWidth  PetalLength  PetalWidth            Name
145          6.7         3.0          5.2         2.3  Iris-virginica
146          6.3         2.5          5.0         1.9  Iris-virginica
147          6.5         3.0          5.2         2.0  Iris-virginica
148          6.2         3.4          5.4         2.3  Iris-virginica
149          5.9         3.0          5.1         1.8  Iris-virginica

In [219]:
df.shape

(150, 5)

In [220]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   SepalLength  150 non-null    float64
 1   SepalWidth   150 non-null    float64
 2   PetalLength  150 non-null    float64
 3   PetalWidth   150 non-null    float64
 4   Name         150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [221]:
df.describe()

       SepalLength  SepalWidth  PetalLength  PetalWidth
count   150.000000  150.000000   150.000000  150.000000
mean      5.843333    3.054000     3.758667    1.198667
std       0.828066    0.433594     1.764420    0.763161
min       4.300000    2.000000     1.000000    0.100000
25%       5.100000    2.800000     1.600000    0.300000
50%       5.800000    3.000000     4.350000    1.300000
75%       6.400000    3.300000     5.100000    1.800000
max       7.900000    4.400000     6.900000    2.500000

In [222]:
df['Name'].unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [223]:
df['Name'].value_counts()

Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: Name, dtype: int64

In [224]:
df.dtypes

SepalLength    float64
SepalWidth     float64
PetalLength    float64
PetalWidth     float64
Name            object
dtype: object

# Weather Dataset

In [225]:
#weather_df = pd.read_excel('weather_data.xlsx')
#weather_df.head()

In [226]:
weather_df = pd.read_csv('D:/Sandhya/Data-Science/csv/nyc.csv')
weather_df

,Unnamed: 0,Date,Max.TemperatureF,Mean.TemperatureF,Min.TemperatureF,Max.Dew.PointF,MeanDew.PointF,Min.DewpointF,Max.Humidity,Mean.Humidity,...,Min.VisibilityMiles,Max.Wind.SpeedMPH,Mean.Wind.SpeedMPH,Max.Gust.SpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees.br...,city,season
0,1,1948-07-01,84,78.0,72,71,65,58,93,65,...,2.0,16,8,NaN,0.00,0.0,Fog,264<br />,New York City (USA),Summer
1,2,1948-07-02,82,72.0,63,62,53,49,76,51,...,10.0,16,10,NaN,0.00,0.0,NaN,315<br />,New York City (USA),Summer
2,3,1948-07-03,78,71.0,64,66,58,53,84,62,...,5.0,14,6,NaN,0.00,0.0,NaN,203<br />,New York City (USA),Summer
3,4,1948-07-04,84,76.0,68,68,63,56,90,67,...,2.0,12,5,NaN,0.00,0.0,Fog,198<br />,New York City (USA),Summer
4,5,1948-07-05,93,82.0,70,74,69,65,93,71,...,3.0,18,8,NaN,0.00,0.0,Fog-Rain-Thunderstorm,218<br />,New York City (USA),Summer
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
24555,24623,2015-12-27,63,56.0,48,58,51,37,96,82,...,0.0,23,12,29.0,0.08,8.0,Fog-Rain,283<br />,New York City (USA),Winter
24556,24624,2015-12-28,48,42.0,35,35,25,19,70,57,...,6.0,23,14,37.0,0.05,7.0,Rain-Snow,39<br />,New York City (USA),Winter
24557,24625,2015-12-29,49,42.0,34,46,40,30,93,88,...,1.0,24,12,30.0,0.66,8.0,Rain-Snow,28<br />,New York City (USA),Winter
24558,24626,2015-12-30,51,46.0,41,48,41,37,93,85,...,2.0,22,7,26.0,0.37,8.0,Rain,65<br />,New York City (USA),Winter
24559,24627,2015-12-31,52,48.0,43,46,38,27,93,71,...,5.0,20,12,25.0,0.06,7.0,Rain,317<br />,New York City (USA),Winter

In [227]:
weather_df.shape

(24560, 26)

In [228]:
weather_df['Max.TemperatureF'].max()

103

In [229]:
weather_df.head()

,Unnamed: 0,Date,Max.TemperatureF,Mean.TemperatureF,Min.TemperatureF,Max.Dew.PointF,MeanDew.PointF,Min.DewpointF,Max.Humidity,Mean.Humidity,...,Min.VisibilityMiles,Max.Wind.SpeedMPH,Mean.Wind.SpeedMPH,Max.Gust.SpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees.br...,city,season
0,1,1948-07-01,84,78.0,72,71,65,58,93,65,...,2.0,16,8,NaN,0.00,0.0,Fog,264<br />,New York City (USA),Summer
1,2,1948-07-02,82,72.0,63,62,53,49,76,51,...,10.0,16,10,NaN,0.00,0.0,NaN,315<br />,New York City (USA),Summer
2,3,1948-07-03,78,71.0,64,66,58,53,84,62,...,5.0,14,6,NaN,0.00,0.0,NaN,203<br />,New York City (USA),Summer
3,4,1948-07-04,84,76.0,68,68,63,56,90,67,...,2.0,12,5,NaN,0.00,0.0,Fog,198<br />,New York City (USA),Summer
4,5,1948-07-05,93,82.0,70,74,69,65,93,71,...,3.0,18,8,NaN,0.00,0.0,Fog-Rain-Thunderstorm,218<br />,New York City (USA),Summer

In [230]:
31*11

341

In [231]:
weather_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24560 entries, 0 to 24559
Data columns (total 26 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Unnamed: 0                 24560 non-null  int64
 1   Date                       24560 non-null  object
 2   Max.TemperatureF           24560 non-null  int64
 3   Mean.TemperatureF          24558 non-null  float64
 4   Min.TemperatureF           24560 non-null  int64
 5   Max.Dew.PointF             24560 non-null  int64
 6   MeanDew.PointF             24560 non-null  int64
 7   Min.DewpointF              24560 non-null  int64
 8   Max.Humidity               24560 non-null  int64
 9   Mean.Humidity              24560 non-null  int64
 10  Min.Humidity               24560 non-null  int64
 11  Max.Sea.Level.PressureIn   24560 non-null  float64
 12  Mean.Sea.Level.PressureIn  24560 non-null  float64
 13  Min.Sea.Level.PressureIn   24560 non-null  float64
 14  Max.VisibilityMiles        24545 non-null  float64
 15  Mean.VisibilityMiles       24545 non-null  float64
 16  Min.VisibilityMiles        24545 non-null  float64
 17  Max.Wind.SpeedMPH          24560 non-null  int64
 18  Mean.Wind.SpeedMPH         24560 non-null  int64
 19  Max.Gust.SpeedMPH          9022 non-null   float64
 20  PrecipitationIn            24560 non-null  object
 21  CloudCover                 21779 non-null  float64
 22  Events                     11721 non-null  object
 23  WindDirDegrees.br...       24560 non-null  object
 24  city                       24560 non-null  object
 25  season                     24560 non-null  object
dtypes: float64(9), int64(11), object(6)
memory usage: 4.9+ MB

# Working with xlsx

In [232]:
#pip install xlrd

In [233]:
#!pip install openpyxl

In [234]:
weather_df = pd.read_excel('D:\Sandhya\Data-Science\csv\weather_data.xlsx')
weather_df.head()

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02           35          7  Sunny
2 2017-01-03           28          2   Snow

# Dataframe to .csv& .xlsx

In [235]:
data = {
    'Name': ['Ajay', 'Atul', 'Arun', 'Raj'],
    'Age': [24,23,25,63]
}
data

{'Name': ['Ajay', 'Atul', 'Arun', 'Raj'], 'Age': [24, 23, 25, 63]}

In [236]:
df = pd.DataFrame(data)
df

   Name  Age
0  Ajay   24
1  Atul   23
2  Arun   25
3   Raj   63

# Write Dataframe to csv

In [237]:
df.to_csv('file_name1.csv')

In [238]:
df1 = pd.read_csv('file_name1.csv')
df1

   Unnamed: 0  Name  Age
0           0  Ajay   24
1           1  Atul   23
2           2  Arun   25
3           3   Raj   63

# Write Dataframe to csv without index

In [239]:
df.to_csv('file_name2.csv', index=False)

In [240]:
df1 = pd.read_csv('file_name2.csv')
df1

   Name  Age
0  Ajay   24
1  Atul   23
2  Arun   25
3   Raj   63

# Write Dataframe to XLSX

In [241]:
df

   Name  Age
0  Ajay   24
1  Atul   23
2  Arun   25
3   Raj   63

In [242]:
df.to_excel('file_name3.xlsx', sheet='student_data')

TypeError: to_excel() got an unexpected keyword argument 'sheet'

In [ ]:
#df.to_excel('file_name3.xlsx', sheet_name='student_data', index=false)

# Adding a new colum

In [243]:
data = {
    'emp no': [101,102,103,104],
    'Name': ['Ajay', 'Atul', 'Arun', 'Raj'],
    'Age': [24,23,25,63]
}
df = pd.DataFrame(data)

In [244]:
df

   emp no  Name  Age
0     101  Ajay   24
1     102  Atul   23
2     103  Arun   25
3     104   Raj   63

In [245]:
df['salary'] = [10000, 20000, 30000, 40000]
df

   emp no  Name  Age  salary
0     101  Ajay   24   10000
1     102  Atul   23   20000
2     103  Arun   25   30000
3     104   Raj   63   40000

# Adding a new row

In [246]:
df

   emp no  Name  Age  salary
0     101  Ajay   24   10000
1     102  Atul   23   20000
2     103  Arun   25   30000
3     104   Raj   63   40000

In [247]:
new_emp = {'emp no': 105, 'Name':'suman', 'Age': 45, 'salary':50000}
new_emp

{'emp no': 105, 'Name': 'suman', 'Age': 45, 'salary': 50000}

In [253]:
df.append(new_emp, ignore_index=True)

C:\Users\Yuvaraj\AppData\Local\Temp\ipykernel_3200\982773456.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(new_emp, ignore_index=True)

   emp no   Name  Age  salary
0     101   Ajay   24   10000
1     102   Atul   23   20000
2     103   Arun   25   30000
3     104    Raj   63   40000
4     105  suman   45   50000

In [261]:
df

   emp no  Name  Age  salary
0     101  Ajay   24   10000
1     102  Atul   23   20000
2     103  Arun   25   30000
3     104   Raj   63   40000

In [262]:
df = df.append(new_emp, ignore_index=True)

C:\Users\Yuvaraj\AppData\Local\Temp\ipykernel_3200\523440361.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_emp, ignore_index=True)

In [263]:
df

   emp no   Name  Age  salary
0     101   Ajay   24   10000
1     102   Atul   23   20000
2     103   Arun   25   30000
3     104    Raj   63   40000
4     105  suman   45   50000

# Deleting a row

In [264]:
df

   emp no   Name  Age  salary
0     101   Ajay   24   10000
1     102   Atul   23   20000
2     103   Arun   25   30000
3     104    Raj   63   40000
4     105  suman   45   50000

In [265]:
df = df.drop(3)
df

   emp no   Name  Age  salary
0     101   Ajay   24   10000
1     102   Atul   23   20000
2     103   Arun   25   30000
4     105  suman   45   50000

# Deleting a column

In [266]:
df

   emp no   Name  Age  salary
0     101   Ajay   24   10000
1     102   Atul   23   20000
2     103   Arun   25   30000
4     105  suman   45   50000

In [267]:
df.drop('salary', axis=1)

   emp no   Name  Age
0     101   Ajay   24
1     102   Atul   23
2     103   Arun   25
4     105  suman   45

In [268]:
df.drop('salary', axis=1, inplace=True)
df

   emp no   Name  Age
0     101   Ajay   24
1     102   Atul   23
2     103   Arun   25
4     105  suman   45

# value_count()-Return a series containing count of unique values

In [270]:
df = pd.read_csv('D:\Sandhya\Data-Science\csv\iris.csv')
df.head(2)

   SepalLength  SepalWidth  PetalLength  PetalWidth         Name
0          5.1         3.5          1.4         0.2  Iris-setosa
1          4.9         3.0          1.4         0.2  Iris-setosa

In [271]:
df['Name'].unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [274]:
df['Name'].value_counts()

Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: Name, dtype: int64

In [275]:
df.describe()

       SepalLength  SepalWidth  PetalLength  PetalWidth
count   150.000000  150.000000   150.000000  150.000000
mean      5.843333    3.054000     3.758667    1.198667
std       0.828066    0.433594     1.764420    0.763161
min       4.300000    2.000000     1.000000    0.100000
25%       5.100000    2.800000     1.600000    0.300000
50%       5.800000    3.000000     4.350000    1.300000
75%       6.400000    3.300000     5.100000    1.800000
max       7.900000    4.400000     6.900000    2.500000

In [276]:
50/150, 50/150

(0.3333333333333333, 0.3333333333333333)

apply(function)- applies the function on all columns

In [277]:
def dummy_fun(x):
    
    if x<1:
        return 0
    else:
        return 1

In [278]:
df

     SepalLength  SepalWidth  PetalLength  PetalWidth            Name
0            5.1         3.5          1.4         0.2     Iris-setosa
1            4.9         3.0          1.4         0.2     Iris-setosa
2            4.7         3.2          1.3         0.2     Iris-setosa
3            4.6         3.1          1.5         0.2     Iris-setosa
4            5.0         3.6          1.4         0.2     Iris-setosa
..           ...         ...          ...         ...             ...
145          6.7         3.0          5.2         2.3  Iris-virginica
146          6.3         2.5          5.0         1.9  Iris-virginica
147          6.5         3.0          5.2         2.0  Iris-virginica
148          6.2         3.4          5.4         2.3  Iris-virginica
149          5.9         3.0          5.1         1.8  Iris-virginica

[150 rows x 5 columns]

In [279]:
df['new_colum'] = df['PetalWidth'].apply(dummy_fun)

In [280]:
df

,SepalLength,SepalWidth,PetalLength,PetalWidth,Name,new_colum
0,5.1,3.5,1.4,0.2,Iris-setosa,0
1,4.9,3.0,1.4,0.2,Iris-setosa,0
2,4.7,3.2,1.3,0.2,Iris-setosa,0
3,4.6,3.1,1.5,0.2,Iris-setosa,0
4,5.0,3.6,1.4,0.2,Iris-setosa,0
...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,Iris-virginica,1
146,6.3,2.5,5.0,1.9,Iris-virginica,1
147,6.5,3.0,5.2,2.0,Iris-virginica,1
148,6.2,3.4,5.4,2.3,Iris-virginica,1
149,5.9,3.0,5.1,1.8,Iris-virginica,1

In [283]:
df.set_index('SepalLength')

             SepalWidth  PetalLength  PetalWidth            Name  new_colum
SepalLength
5.1                 3.5          1.4         0.2     Iris-setosa          0
4.9                 3.0          1.4         0.2     Iris-setosa          0
4.7                 3.2          1.3         0.2     Iris-setosa          0
4.6                 3.1          1.5         0.2     Iris-setosa          0
5.0                 3.6          1.4         0.2     Iris-setosa          0
...                 ...          ...         ...             ...        ...
6.7                 3.0          5.2         2.3  Iris-virginica          1
6.3                 2.5          5.0         1.9  Iris-virginica          1
6.5                 3.0          5.2         2.0  Iris-virginica          1
6.2                 3.4          5.4         2.3  Iris-virginica          1
5.9                 3.0          5.1         1.8  Iris-virginica          1

[150 rows x 5 columns]

In [284]:
df.set_index('Name')

                SepalLength  SepalWidth  PetalLength  PetalWidth  new_colum
Name
Iris-setosa             5.1         3.5          1.4         0.2          0
Iris-setosa             4.9         3.0          1.4         0.2          0
Iris-setosa             4.7         3.2          1.3         0.2          0
Iris-setosa             4.6         3.1          1.5         0.2          0
Iris-setosa             5.0         3.6          1.4         0.2          0
...                     ...         ...          ...         ...        ...
Iris-virginica          6.7         3.0          5.2         2.3          1
Iris-virginica          6.3         2.5          5.0         1.9          1
Iris-virginica          6.5         3.0          5.2         2.0          1
Iris-virginica          6.2         3.4          5.4         2.3          1
Iris-virginica          5.9         3.0          5.1         1.8          1

[150 rows x 5 columns]

In [285]:
df.set_index('Name', inplace = True)

In [286]:
df

                SepalLength  SepalWidth  PetalLength  PetalWidth  new_colum
Name
Iris-setosa             5.1         3.5          1.4         0.2          0
Iris-setosa             4.9         3.0          1.4         0.2          0
Iris-setosa             4.7         3.2          1.3         0.2          0
Iris-setosa             4.6         3.1          1.5         0.2          0
Iris-setosa             5.0         3.6          1.4         0.2          0
...                     ...         ...          ...         ...        ...
Iris-virginica          6.7         3.0          5.2         2.3          1
Iris-virginica          6.3         2.5          5.0         1.9          1
Iris-virginica          6.5         3.0          5.2         2.0          1
Iris-virginica          6.2         3.4          5.4         2.3          1
Iris-virginica          5.9         3.0          5.1         1.8          1

[150 rows x 5 columns]

# Sorting by values

In [287]:
df

                SepalLength  SepalWidth  PetalLength  PetalWidth  new_colum
Name
Iris-setosa             5.1         3.5          1.4         0.2          0
Iris-setosa             4.9         3.0          1.4         0.2          0
Iris-setosa             4.7         3.2          1.3         0.2          0
Iris-setosa             4.6         3.1          1.5         0.2          0
Iris-setosa             5.0         3.6          1.4         0.2          0
...                     ...         ...          ...         ...        ...
Iris-virginica          6.7         3.0          5.2         2.3          1
Iris-virginica          6.3         2.5          5.0         1.9          1
Iris-virginica          6.5         3.0          5.2         2.0          1
Iris-virginica          6.2         3.4          5.4         2.3          1
Iris-virginica          5.9         3.0          5.1         1.8          1

[150 rows x 5 columns]

In [288]:
df.sort_index()

                SepalLength  SepalWidth  PetalLength  PetalWidth  new_colum
Name
Iris-setosa             5.1         3.5          1.4         0.2          0
Iris-setosa             4.9         3.0          1.4         0.2          0
Iris-setosa             4.7         3.2          1.3         0.2          0
Iris-setosa             4.6         3.1          1.5         0.2          0
Iris-setosa             5.0         3.6          1.4         0.2          0
...                     ...         ...          ...         ...        ...
Iris-virginica          6.7         3.0          5.2         2.3          1
Iris-virginica          6.3         2.5          5.0         1.9          1
Iris-virginica          6.5         3.0          5.2         2.0          1
Iris-virginica          6.2         3.4          5.4         2.3          1
Iris-virginica          5.9         3.0          5.1         1.8          1

[150 rows x 5 columns]

In [290]:
df.sort_index(ascending=False)

                SepalLength  SepalWidth  PetalLength  PetalWidth  new_colum
Name
Iris-virginica          5.9         3.0          5.1         1.8          1
Iris-virginica          6.4         2.7          5.3         1.9          1
Iris-virginica          7.7         2.8          6.7         2.0          1
Iris-virginica          5.6         2.8          4.9         2.0          1
Iris-virginica          6.9         3.2          5.7         2.3          1
...                     ...         ...          ...         ...        ...
Iris-setosa             5.4         3.4          1.5         0.4          0
Iris-setosa             4.8         3.1          1.6         0.2          0
Iris-setosa             4.7         3.2          1.6         0.2          0
Iris-setosa             5.2         3.4          1.4         0.2          0
Iris-setosa             5.1         3.5          1.4         0.2          0

[150 rows x 5 columns]

In [291]:
df.sort_values(by ='SepalLength')

                SepalLength  SepalWidth  PetalLength  PetalWidth  new_colum
Name
Iris-setosa             4.3         3.0          1.1         0.1          0
Iris-setosa             4.4         3.2          1.3         0.2          0
Iris-setosa             4.4         3.0          1.3         0.2          0
Iris-setosa             4.4         2.9          1.4         0.2          0
Iris-setosa             4.5         2.3          1.3         0.3          0
...                     ...         ...          ...         ...        ...
Iris-virginica          7.7         2.8          6.7         2.0          1
Iris-virginica          7.7         2.6          6.9         2.3          1
Iris-virginica          7.7         3.8          6.7         2.2          1
Iris-virginica          7.7         3.0          6.1         2.3          1
Iris-virginica          7.9         3.8          6.4         2.0          1

[150 rows x 5 columns]

In [294]:
df.sort_values(by =['SepalLength','SepalWidth'], ascending=False)

                SepalLength  SepalWidth  PetalLength  PetalWidth  new_colum
Name
Iris-virginica          7.9         3.8          6.4         2.0          1
Iris-virginica          7.7         3.8          6.7         2.2          1
Iris-virginica          7.7         3.0          6.1         2.3          1
Iris-virginica          7.7         2.8          6.7         2.0          1
Iris-virginica          7.7         2.6          6.9         2.3          1
...                     ...         ...          ...         ...        ...
Iris-setosa             4.5         2.3          1.3         0.3          0
Iris-setosa             4.4         3.2          1.3         0.2          0
Iris-setosa             4.4         3.0          1.3         0.2          0
Iris-setosa             4.4         2.9          1.4         0.2          0
Iris-setosa             4.3         3.0          1.1         0.1          0

[150 rows x 5 columns]

In [ ]:
df.